{
  "recipes": [
    {
      "name": "Grilled Chicken Caprese with Burrata Recipe",
      "category": "meat",
      "calories": 375,
      "servings": 4,
      "prepTime": "20 min",
      "cookTime": "15 min",
      "totalTime": "",
      "emoji": "🍖",
      "source": "https://therealfooddietitians.com/chicken-caprese/#tasty-recipes-68440",
      "notes": "",
      "ingredients": [
        "½ cup balsamic vinegar (or use a store bought balsamic glaze)",
        "2 tablespoons extra virgin olive oil",
        "2 tablespoons balsamic vinegar",
        "2 teaspoons dried Italian seasoning",
        "1 teaspoon pure honey",
        "½ teaspoon fine salt",
        "¼ teaspoon black pepper",
        "1 &#8211; 1 ¼ lb. boneless skinless chicken breasts, pounded to ¾-inch thickness and cut into 4 portions (if using 2 large breasts)",
        "1 pint (2 cups) cherry or grape tomatoes, halved",
        "2 teaspoons extra virgin olive oil",
        "Pinch of fine salt",
        "⅓ &#8211; ½ cup thinly sliced fresh basil leaves",
        "1 8-ounce or 2 4-ounce ball(s) fresh burrata cheese, drained and cut into quarters or halves, depending on size (4 portions total)"
      ],
      "steps": [
        "If making the homemade balsamic glaze, add the balsamic vinegar to a small saucepan over medium-high heat.",
        "Bring to a boil then reduce heat to low and simmer until reduced by half (about 10-15 minutes), stirring occasionally.",
        "Remove the pan from the heat and allow the glaze to cool. NOTE: It will thicken as it cools. This step can be done up to 4 days in advance. Store unused glaze in an airtight container with lid for up to 1 week in the refrigerator.",
        "Make the chicken marinade by whisking together the 2 tablespoons olive oil, balsamic vinegar, Italian seasoning, honey, salt, and pepper in a shallow bowl or glass pie plate.",
        "Add the chicken pieces and turn them 2 to 3 times to coat both sides. Then nestle the chicken into the marinade, cover, and marinate in the refrigerator for 30 minutes or up to 8 hours.",
        "When ready to cook, preheat an outdoor grill (or use a grill pan on the stove) to medium-high heat (400℉).",
        "When the grill is hot, remove the chicken from the marinade, allowing excess marinade to drip off. Discard the leftover marinade.",
        "Add the chicken directly to the grill grate and cook over indirect heat for 5-6 minutes.",
        "Flip the chicken over and cook until the chicken is cooked through and no longer pink in the thickest part, an additional 4-6 minutes. Transfer the chicken to a clean plate.",
        "While the chicken is cooking, prepare the tomato salad. In a medium bowl, combine the cherry tomatoes, olive oil, and a pinch of salt. Toss gently to combine, then fold the sliced basil into the tomato mixture.",
        "To serve, top each chicken breast with a 2-ounce portion of the burrata and ½ cup of the tomato-basil mixture.",
        "Drizzle with 1-2 teaspoons balsamic glaze and sprinkle with flaky sea salt and black pepper. Serve immediately."
      ],
      "tags": [],
      "nutrition": {
        "calories": 375,
        "fat": "20 g",
        "saturatedFat": "9 g",
        "carbs": "8 g",
        "fiber": "1 g",
        "sugar": "7 g",
        "protein": "40 g",
        "sodium": "260 mg"
      },
      "thumbnail": "https://therealfooddietitians.com/wp-content/uploads/2025/07/grilled-chicken-with-burrata-5-225x225.jpg",
      "id": "rmlvcv00akvdd",
      "dateAdded": "2026-02-20"
    },
    {
      "name": "Chicken and Lime Soup",
      "category": "soups",
      "calories": 203,
      "servings": 6,
      "prepTime": "10 min",
      "cookTime": "60 min",
      "totalTime": "",
      "emoji": "🍜",
      "source": "https://www.budgetbytes.com/chicken-lime-soup/",
      "notes": "Add 1cup corn for extra flavor/texture",
      "ingredients": [
        "1  yellow onion ($0.21)",
        "3  ribs celery  (about 1/4 bunch, $0.37)",
        "1  jalapeño  ($0.17)",
        "4 cloves garlic  ($0.32)",
        "2 Tbsp olive oil  ($0.32)",
        "1  boneless, skinless chicken breast  (about 3/4 lb. , $2.32)",
        "6 cups chicken broth (*, $0.78)",
        "2 10oz. cans diced tomatoes with green chiles (Rotel) ($0.90)",
        "1 tsp oregano ($0.10)",
        "1/2 Tbsp cumin  ($0.15)",
        "1  lime  ($0.22)",
        "1/2  bunch cilantro  ($0.40)",
        "1  avocado  ($1.50)"
      ],
      "steps": [
        "Dice the onion, celery, and jalapeño (scrape the seeds out of the jalapeño before dicing). Mince the garlic. Add the onion, celery, jalapeño, garlic, and olive oil to a large soup pot and cook over medium heat for about 5 minutes, or until the onions are soft and translucent.",
        "Add the chicken breast, chicken broth, diced tomatoes with chiles (with juices), oregano, and cumin to the pot. Place a lid on the pot, turn the heat up to high, and bring the broth up to a boil. Once boiling, turn the heat down to low and let the pot simmer for 45 minutes.",
        "After simmering for 45 minutes, carefully remove the chicken breast from the pot and use two forks to shred the meat. Return the shredded meat to the pot. Squeeze the juice of one lime into the soup (2-3 Tbsp juice).",
        "Rinse the cilantro and then roughly chop the leaves. Add the chopped cilantro to the soup, give it a quick stir, then serve. Slice the avocado and add a few slices to each bowl."
      ],
      "tags": [
        "chicken soup"
      ],
      "nutrition": {
        "calories": 203,
        "fat": "11.27 g",
        "carbs": "12.35 g",
        "fiber": "3.73 g",
        "protein": "15.9 g",
        "sodium": "1289.98 mg"
      },
      "thumbnail": "https://www.budgetbytes.com/wp-content/uploads/2012/10/Chicken-and-Lime-Soup-above.jpg",
      "id": "rmlvcyss2lhqf",
      "dateAdded": "2026-02-20",
      "ratings": {
        "katie": 7,
        "dan": 7
      },
      "lastModified": "2026-02-20"
    },
    {
      "name": "Summer Berry Pasta Salad with Chicken Recipe",
      "category": "pasta",
      "calories": 344,
      "servings": 10,
      "prepTime": "20 min",
      "cookTime": "10 min",
      "totalTime": "",
      "emoji": "🍝",
      "source": "https://therealfooddietitians.com/summer-pasta-salad/",
      "notes": "",
      "ingredients": [
        "6 ounces regular or gluten-free pasta of choice, cooked according to package directions and cooled (see notes)",
        "2 cups loose-packed baby spinach leaves",
        "2 cups cooked and diced chicken or shredded chicken",
        "1½ cups fresh berries of choice (if using strawberries, slice them)",
        "⅓ cup diced red onion",
        "⅓ cup sliced toasted almonds**",
        "¼ cup dried cranberries or dried cherries",
        "2 green onions, ends trimmed, white and green parts thinly sliced",
        "3 tablespoons chopped fresh basil, plus more for garnish",
        "⅔ cup mayonnaise*",
        "¼ cup apple cider vinegar",
        "2 tablespoons lemon juice (½ of a large lemon)",
        "2 tablespoons pure honey",
        "1 tablespoon extra-virgin olive oil",
        "2 teaspoons poppy seeds",
        "¼ teaspoon fine salt",
        "Pinch of black pepper"
      ],
      "steps": [
        "Cook the pasta according to package directions until al dente. Then rinse under cold water to cool. (Note: The pasta can be cooked and cooled up to 2 days ahead of time.)",
        "While the pasta is cooking, prepare the dressing: In a small bowl, whisk together the mayo, vinegar, lemon, honey, olive oil, poppy seeds, salt, and pepper until smooth. Set aside.",
        "In a large bowl, combine the salad ingredients: the cooked pasta, the spinach, cooked chicken, berries, red onion, almonds, cranberries, green onions, and basil.",
        "Pour the dressing over the salad ingredients and toss gently to combine.",
        "Garnish with additional fresh basil if desired.",
        "Serve right away or refrigerate until ready to serve, tossing gently just before serving.",
        "Store leftovers in an airtight container in the refrigerator for up to 3 days."
      ],
      "tags": [
        "summer pasta salad",
        "salads"
      ],
      "nutrition": {
        "calories": 344,
        "fat": "20 g",
        "saturatedFat": "3 g",
        "carbs": "30 g",
        "fiber": "3 g",
        "sugar": "10 g",
        "protein": "15 g",
        "sodium": "320 mg"
      },
      "thumbnail": "https://therealfooddietitians.com/wp-content/uploads/2021/07/Summer-Berry-Pasta-Salad_LowRes-018-225x225.jpg",
      "id": "rmlvdkpme3hi6",
      "dateAdded": "2026-02-20",
      "ratings": {
        "katie": null,
        "dan": 7
      },
      "lastModified": "2026-02-20"
    },
    {
      "name": "Baked Tomato & Feta Rice",
      "category": "casseroles",
      "calories": 274,
      "servings": 6,
      "prepTime": "",
      "cookTime": "",
      "totalTime": "",
      "emoji": "🥘",
      "source": "https://www.eatingwell.com/baked-tomato-feta-rice-8775988",
      "notes": "",
      "ingredients": [
        "5 cups cherry tomatoes",
        "1½ cups brown rice",
        "3 cloves garlic, minced",
        "1 tablespoon finely chopped fresh oregano, plus leaves for garnish",
        "½ teaspoon ground pepper",
        "½ teaspoon crushed red pepper (optional)",
        "½ teaspoon salt",
        "3 cups boiling water",
        "1 (6-ounce) block feta cheese"
      ],
      "steps": [
        "Preheat oven to 375°F. Lightly coat a broiler-safe 9-by-13-inch baking dish with cooking spray.",
        "Combine 5 cups tomatoes, 1½ cups rice, minced garlic, 1 tablespoon oregano and ½ teaspoon each ground pepper, crushed red pepper (if using) and salt in the prepared dish. Carefully pour in 3 cups boiling water; stir until the mixture is well combined and the rice is fully submerged. Nestle 1 (6-ounce) block feta in the center of the mixture. Tightly cover the dish with foil. Bake, undisturbed, until the rice is tender and the tomatoes are soft, about 1 hour. Remove the foil and continue baking until the liquid has evaporated, about 15 minutes more.",
        "Increase oven temperature to broil. Broil until the feta is lightly browned, 2 to 3 minutes. Remove from oven and stir until the feta is broken into small pieces throughout the rice mixture. Garnish with oregano, if desired."
      ],
      "tags": [
        "baked tomato",
        "casserole",
        "dinner",
        "american"
      ],
      "nutrition": {
        "calories": 274,
        "fat": "8 g",
        "saturatedFat": "5 g",
        "carbs": "43 g",
        "fiber": "4 g",
        "sugar": "4 g",
        "protein": "9 g",
        "sodium": "452 mg"
      },
      "thumbnail": "https://www.eatingwell.com/thmb/y5tbLaDX1hoxbaS8w3E9lrk5A3g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/EWL-Baked-Tomato-Feta-Rice-Casserole-1x1-219_preview_maxWidth_4000_maxHeight_4000_ppi_300_quality_100-291107471255478f9edbd790caf4b9f3.jpg",
      "id": "rmlvdpwf4oxhr",
      "dateAdded": "2026-02-20"
    },
    {
      "name": "Easy Lasagna Soup Recipe",
      "category": "soups",
      "calories": 169,
      "servings": 12,
      "prepTime": "15 min",
      "cookTime": "30 min",
      "totalTime": "",
      "emoji": "🍜",
      "source": "https://thekitchengirl.com/lasagna-soup/",
      "notes": "",
      "ingredients": [
        "1-2 tablespoons Olive Oil (or preferred oil)",
        "1 pound Ground Beef",
        "1 large Onion (diced)",
        "4 cloves Garlic (minced)",
        "1 (15-ounce can) Diced Tomatoes (don&#39;t drain)",
        "1 (15-ounce can) Tomato Sauce (or tomato puree)",
        "1/3 cup Tomato Paste (about half of a 6-ounce can)",
        "4 cups Chicken Broth",
        "1-2 cups Water (to adjust consistency)",
        "1 tablespoon Italian Seasoning",
        "1 teaspoon Sea Salt (or more as needed to adjust flavor)",
        "Black Pepper (to taste)",
        "8 ounces Bowtie Pasta (uncooked) (or similar sturdy pasta * see footnote)",
        "1/2 cup Ricotta Cheese",
        "2 ounces Mozzarella Cheese (shredded (about 1/2 cup))",
        "1/4 cup Parmesan Cheese (shaved, shredded, or fresh grated)",
        "1/4 cup Fresh Parsley (chopped)"
      ],
      "steps": [
        "Heat a 4.5-quart soup pot over medium-high heat. Add OLIVE OIL and heat until shimmering.",
        "Add GROUND BEEF, ONIONS, and GARLIC. Sauté until the beef is cooked through, stirring as needed. Drain excess fat, if needed.",
        "Stir in TOMATOES (with their juice), TOMATO SAUCE, TOMATO PASTE, BROTH, ITALIAN SEASONING, SALT, PEPPER, and PASTA NOODLES.",
        "Increase the heat to HIGH and bring the soup to a boil.",
        "Reduce heat to a medium simmer and cook soup for 10 to 15 minutes until the pasta is cooked to your liking, stirring frequently to prevent the pasta from sticking together.At this point you can add WATER or more broth in small amounts to adjust the soup consistency to your liking.",
        "Serving options: 1) Add the RICOTTA, MOZZARELLA, and PARMESAN to the whole soup after it cools slightly; or 2) Serve the cheeses on the side and add it to individual servings. Garnish with FRESH PARSLEY.",
        "To store: Cool completely and refrigerate in an airtight container up to 5 days or up to 90 days in the freezer (or more if vacuum sealed).To reheat: Add more water or broth as desired because the noodles will have absorbed much of the broth."
      ],
      "tags": [
        "easy lasagna soup recipe",
        "how to make lasagna soup",
        "lasagna soup",
        "dinner recipes",
        "main course",
        "american",
        "italian"
      ],
      "nutrition": {
        "calories": 169,
        "fat": "12 g",
        "saturatedFat": "5 g",
        "carbs": "5 g",
        "fiber": "1 g",
        "sugar": "2 g",
        "protein": "12 g",
        "sodium": "378 mg"
      },
      "thumbnail": "https://thekitchengirl.com/wp-content/uploads/lasagna-soup-b_13-2.jpg",
      "id": "rmlvdu7zajmhs",
      "dateAdded": "2026-02-20"
    },
    {
      "name": "Small Batch Lasagna",
      "category": "pasta",
      "calories": 506,
      "servings": 6,
      "prepTime": "35 min",
      "cookTime": "35 min",
      "totalTime": "",
      "emoji": "🍝",
      "source": "https://www.simplyscratch.com/small-batch-lasagna/",
      "notes": "",
      "ingredients": [
        "1 teaspoon olive oil",
        "1 medium yellow onion (diced)",
        "2 cloves garlic (minced)",
        "kosher salt",
        "1 pound turkey Italian sausage (or regular italian sausage (we like hot italian sausage))",
        "28 ounces marinara ((see notes))",
        "15 ounces ricotta cheese",
        "1 large egg",
        "2 tablespoons parmesan cheese (freshly grated )",
        "1 tablespoon parsley",
        "8  no-boil (oven ready lasagna noodles)",
        "2 cups mozzarella cheese (freshly grated )"
      ],
      "steps": [
        "Preheat your oven to 375℉  (or 190℃) and grease a 9x9x2.5-inch square baking dish.",
        "Add olive oil, onion and garlic with a pinch of kosher salt to a deep sided skillet. Heat on medium-low, stir and cook 5 minutes or until softened.",
        "Increase the heat to medium-high and add in the ground meat or sausage. Use a wooden spatula or spoon to break up the sausage. Stir often until no longer pink and the meat is browned. Drain and discard any fat in the pan.",
        "Once the sausage or meat is browned and the fat removed from the pan, pour in the marinara. I added 1 (28-ounce) jar to a liquid measuring cup and  added enough water until it reached 4 cups.Remove the pan from the heat and pour the marinara. There&#39;s no need to simmer.",
        "Meanwhile, in a medium bowl combine the ricotta, egg, 2 tablespoon parmesan cheese and parsley. Season with a pinch of kosher salt and some freshly ground black pepper. Stir to combine.",
        "Spread a few large spoonfuls of sauce on the bottom of the prepared baking dish.",
        "Lay down 2 noodles, side by side and top with 1/3 (I just eyeball it) of the ricotta mixture and spread it evenly.",
        "Top with 1/4 of the sauce and sprinkle with a little less than 1/3 of the 2 cups of mozzarella (or about a generous 1/2 cup).",
        "Lay down 2 noodles (going the opposite direction), side by side and top with 1/3 of the ricotta mixture and spread it evenly.",
        "Top with 1/4 of the sauce and sprinkle with a little less than 1/3 of the mozzarella.",
        "Lay down 2 more noodles (going the opposite direction) side by side and top with the remaining 1/3 of ricotta mixture and spread it evenly.",
        "Top with 1/4 of the sauce. (no cheese)",
        "Lay down the final 2 noodles (going the opposite direction) side by side and top with the last of the sauce.",
        "Sprinkle with the remaining mozzarella cheese and parmesan.",
        "Transfer to a rimmed metal baking sheet (to catch any spill over) and bake uncovered for 30 to 40 minutes or until bubbly and the cheese is golden brown.",
        "Let cool 10 minutes before slicing and serving."
      ],
      "tags": [
        "baked pasta",
        "homemade",
        "lasagna",
        "pasta",
        "small batch",
        "mains &amp; entrees"
      ],
      "nutrition": {
        "calories": 506,
        "fat": "27 g",
        "saturatedFat": "14 g",
        "carbs": "34 g",
        "fiber": "4 g",
        "sugar": "9 g",
        "protein": "34 g",
        "sodium": "1662 mg"
      },
      "thumbnail": "https://www.simplyscratch.com/wp-content/uploads/2020/03/Small-Batch-Lasagna-l-SimplyScratch.com-easy-smallbatch-lasagna-dinner-pasta-bakedpasta-recipe-20.jpg",
      "id": "rmlvdwwbsr3tq",
      "dateAdded": "2026-02-20",
      "ratings": {
        "katie": null,
        "dan": 8
      },
      "lastModified": "2026-02-20"
    },
    {
      "name": "Sausage Tortellini Soup with Spinach",
      "category": "soups",
      "calories": 534,
      "servings": 6,
      "prepTime": "10 min",
      "cookTime": "35 min",
      "totalTime": "",
      "emoji": "🍜",
      "source": "https://www.yellowblissroad.com/tortellini-soup-with-italian-sausage-spinach/",
      "notes": "",
      "ingredients": [
        "1 tablespoon vegetable oil",
        "1 pound ground Italian sausage ((mild or spicy))",
        "1/2 cup diced onion ((about 1/2 medium sized onion))",
        "1 tablespoon minced garlic ((3-4 garlic cloves))",
        "28 ounces canned crushed tomatoes",
        "32 ounces vegetable or chicken broth",
        "2 tablespoons fresh chopped basil ((or 1 teaspoon dried))",
        "Salt and pepper (to taste)",
        "9 ounces refrigerated cheese tortellini",
        "2 cups packed fresh baby spinach",
        "6  baguette slices ((about 1/3 of a baguette))",
        "1 tablespoon butter",
        "2 tablespoons freshly shredded Parmesan cheese"
      ],
      "steps": [
        "Heat oil in a large pot or Dutch oven over medium-high heat. Add diced onion and sauté for 3-4 minutes until softened.",
        "Add Italian sausage and garlic. Cook, breaking the sausage into pieces, until browned and no longer pink, about 4-5 minutes. Drain any excess grease.",
        "Stir in crushed tomatoes, broth, basil, salt, and pepper. Bring to a boil, then reduce heat to low. Cover and simmer for 20-30 minutes.",
        "Add tortellini and cook for 5 minutes, or until pasta is tender.",
        "Stir in spinach, cover, and turn off heat. Let sit for 1-2 minutes until spinach is wilted.",
        "Serve topped with Parmesan cheese and a cheesy crostini if desired.",
        "For Crostini (Optional): Slice baguette into ½-inch thick pieces. Butter one side and place butter-side down in a hot skillet until golden. Flip, top with Parmesan, and cook until the other side is golden. Cover briefly if needed to melt cheese."
      ],
      "tags": [
        "tortellini soup",
        "dinner",
        "soup",
        "american",
        "italian"
      ],
      "nutrition": {
        "calories": 534,
        "fat": "33 g",
        "saturatedFat": "13 g",
        "carbs": "40 g",
        "fiber": "5 g",
        "sugar": "9 g",
        "protein": "22 g",
        "sodium": "1654 mg"
      },
      "thumbnail": "https://www.yellowblissroad.com/wp-content/uploads/2018/12/Tortellini-Soup-social.jpg",
      "id": "rmlvdxikkvrbz",
      "dateAdded": "2026-02-20",
      "ratings": {
        "katie": null,
        "dan": 8
      },
      "lastModified": "2026-02-20"
    },
    {
      "name": "Original Baked Feta Pasta Recipe (Viral Tiktok Pasta)",
      "category": "pasta",
      "calories": 0,
      "servings": 4,
      "prepTime": "5 min",
      "cookTime": "40 min",
      "totalTime": "",
      "emoji": "🍝",
      "source": "https://grilledcheesesocial.com/2019/06/27/baked-feta-pasta-with-tomatoes/",
      "notes": "",
      "ingredients": [
        "1 lb Pasta ((I recommend bowtie or orzo))",
        "1/2 cup Olive Oil",
        "2 pints Cherry Tomatoes ((around 20-25 oz))",
        "1 8 oz block  Feta Cheese",
        "4 cloves Garlic (finely chopped)",
        "2 pinches Red Pepper Flakes",
        "1 handful Fresh Basil Leaves",
        "Kosher Salt and Fresh Cracked Pepper",
        "Balsamic Glaze ((if the tomatoes are too sour))"
      ],
      "steps": [
        "Preheat oven to 400. Add tomatoes, olive oil, and salt to a baking dish and toss.",
        "Place the block of feta in the middle and top with a splash more of olive oil plus a few pinches red pepper flakes. Bake for 30 minutes.",
        "Meanwhile, prepare bowtie pasta al dente according to directions then strain -- being sure to save some pasta water for later on.",
        "After the 30 minutes has past, crank the heat up to 450 and bake for another 5-10 minutes or until the feta and tomatoes have browned.",
        "Remove the baking dish from the oven and IMMEDIATELY add the garlic and basil and stir. The residual heat from the tomatoes and olive oil will take the raw edge off the garlic.",
        "Now stir in the strained al dente pasta and toss. Season with salt and pepper to taste! (And if the sauce is dry, you can add 1/4 cup pasta water and stir to loosen the sauce!)",
        "**If the tomatoes are out of season and are too sour or tart, try adding in some balsamic glaze to sweeten it up."
      ],
      "tags": [
        "baked",
        "basil",
        "bowties",
        "easy",
        "feta",
        "garlic"
      ],
      "nutrition": {
        "calories": 0
      },
      "thumbnail": "https://grilledcheesesocial.com/wp-content/uploads/2019/06/baked-feta-pasta-tomatoes-grilled-cheese-social-6.jpg",
      "id": "rmlve4lbkics7",
      "dateAdded": "2026-02-20"
    },
    {
      "name": "Original Baked Feta Pasta Recipe (Viral Tiktok Pasta)",
      "category": "pasta",
      "calories": 670,
      "servings": 4,
      "prepTime": "5 min",
      "cookTime": "40 min",
      "totalTime": "",
      "emoji": "🍝",
      "source": "https://grilledcheesesocial.com/2019/06/27/baked-feta-pasta-with-tomatoes/",
      "notes": "",
      "ingredients": [
        "1 lb Pasta ((I recommend bowtie or orzo))",
        "1/2 cup Olive Oil",
        "2 pints Cherry Tomatoes ((around 20-25 oz))",
        "1 8 oz block  Feta Cheese",
        "4 cloves Garlic (finely chopped)",
        "2 pinches Red Pepper Flakes",
        "1 handful Fresh Basil Leaves",
        "Kosher Salt and Fresh Cracked Pepper",
        "Balsamic Glaze ((if the tomatoes are too sour))"
      ],
      "steps": [
        "Preheat oven to 400. Add tomatoes, olive oil, and salt to a baking dish and toss.",
        "Place the block of feta in the middle and top with a splash more of olive oil plus a few pinches red pepper flakes. Bake for 30 minutes.",
        "Meanwhile, prepare bowtie pasta al dente according to directions then strain -- being sure to save some pasta water for later on.",
        "After the 30 minutes has past, crank the heat up to 450 and bake for another 5-10 minutes or until the feta and tomatoes have browned.",
        "Remove the baking dish from the oven and IMMEDIATELY add the garlic and basil and stir. The residual heat from the tomatoes and olive oil will take the raw edge off the garlic.",
        "Now stir in the strained al dente pasta and toss. Season with salt and pepper to taste! (And if the sauce is dry, you can add 1/4 cup pasta water and stir to loosen the sauce!)",
        "**If the tomatoes are out of season and are too sour or tart, try adding in some balsamic glaze to sweeten it up."
      ],
      "tags": [
        "baked",
        "basil",
        "bowties",
        "easy",
        "feta",
        "garlic"
      ],
      "nutrition": {
        "calories": 0
      },
      "thumbnail": "https://grilledcheesesocial.com/wp-content/uploads/2019/06/baked-feta-pasta-tomatoes-grilled-cheese-social-6.jpg",
      "id": "rmlve7nwnqtur",
      "dateAdded": "2026-02-20"
    }
  ],
  "version": "1.0"
}